import type { Backgrounds } from "./types";

export const backgrounds: Backgrounds = [
	{
		id: "1",
		title: "Що? Я тут не вперше.",
		description:
			"1 раз на локацію (або на розсуд ГМ). Ви випадково знаєте САМЕ ту людину, яка володіє інформацією, яку ви шукаєте, або може витягнути вас із халепи, і… Киньте 1d20: • 1–5. Вони хочуть вашої СМЕРТІ. • 6–12. Ви винні їм гроші. • 13–19. Її можна переконати допомогти тобі. • 20. Вона — твій найбільший шанувальник/шалено закохана в тебе.",
	},
	{
		id: "2",
		title: "Дикий",
		description:
			"Чи то гілочки та квіти у твоєму волоссі, чи твій запах, чи постава — дикі тварини менше бояться тебе і охочіше готові тобі допомогти. +1 до навички «Природа». Під час rкороткого відпочинку на природі кидай кубики здоров’я з перевагою, перебуваючи в дикій місцевості.",
	},
	{
		id: "3",
		title: "Виживальник",
		description:
			"У вас ніколи не закінчуються особисті запаси провізії. Якщо докласти достатньо зусиль, їжею може стати що завгодно! Перевага при кидках на захист від отрути. Максимальний показник «Hit Die» +1.",
	},
	{
		id: "4",
		title: "Ремісник/майстер",
		description:
			"Оберіть професію (пекар/кухар, коваль, каменяр, ткач, виробник шкіряних виробів тощо). Виконання завдань, пов’язаних із цією професією, проходить успішніше. Ви також володієте спеціальними знаннями, пов’язаними з вашою професією.",
	},
];
