import type { Origins } from "./types";

export const origins: Origins = [
	{
		id: "dwarf",
		origin: "Гном",
		size: "середній",
		description:
			"Слово «гном» у стародавній мові означає «камінь». Ти витривалий, міцний і кремезний. Навіть коли тебе довели до виснаження, ти не знесилишся. Поступаючись швидкістю, ти наділений фізичною життєвою силою та шлунком, здатним перетравлювати найкращі (і найгірші) страви, які тільки може запропонувати цей світ.",
		ability: [
			"Стійкий",
			"+2 до максимальної кількості очок здоров'я, +1 до максимальної кількості ран, –1 до швидкості",
			"Ви володієте мовою гномів, якщо ваш показник інтелекту не є від’ємним.",
		],
	},
	{
		id: "dragonborn",
		origin: "Драконороджений",
		size: "середній",
		description:
			"У тобі палає душа дракона, а луска твого тіла — немов кована сталь. Ти — як піч, а твоє походження — вугілля, що розпалює твоє полум’я. Звернися до свого гніву, щоб говорити мовою своїх предків і наповнити свої атаки нестримною люттю.",
		ability: [
			"Драконяча спадщина",
			"+1 до броні. Коли ти атакуєш: завдаєш додаткових LVL+KEY очок шкоди (ігноруючи броню), розподілених на твій вибір між будь-якими з твоїх цілей; відновлюється щоразу, коли ти відпочиваєш у безпеці або отримуєш поранення.",
			"Ти знаєш драконячу мову, якщо твій INT не є від’ємним",
		],
	},
	{
		id: "dryad",
		origin: "Дріада",
		size: "середній",
		description:
			"Дріади, тісно пов’язані з природою, уособлюють рівновагу між флорою та фауною. Їхня унікальна фізіологія дозволяє виділяти токсичні спори, коли їм завдають шкоди, забезпечуючи природний захист від тих, хто наважується їх скривдити.",
		ability: [
			"Небезпечний пилок",
			"Щоразу, коли ворог завдає вам одну або більше ран, ви виділяєте снодійні спори: усі сусіди-вороги отримують стан «Запаморочення»",
			"Ви розумієте ельфійську мову, якщо ваш показник INT не є від’ємним.",
		],
	},
];
